tutorials/pimpleHFDIBFoam/Immersed-SphereinCube-3D-Oscil/Immersed-Sphere-Oscillating/ImmersedSphere-Sin-Re20-800k/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  3D cube mesh for oscillating sphere in cube                                |
|  Doubled resolution in x, y, z                                              |
|  Domain: [-1,1] x [-1,1] x [-1,1]                                           |
|  Sphere D = 1, initial centre (0 0 0)                                        |
|  Motion: x_c(t) = 0.125*(1 - cos(2*pi*t)), centre x in [0,0.25]             |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1 -1   -1)
    (-1 -0.6 -1)
    (-1  0.6 -1)
    (-1  1   -1)
    (-1 -1    1)
    (-1 -0.6  1)
    (-1  0.6  1)
    (-1  1    1)

    (-0.6 -1   -1)
    (-0.6 -0.6 -1)
    (-0.6  0.6 -1)
    (-0.6  1   -1)
    (-0.6 -1    1)
    (-0.6 -0.6  1)
    (-0.6  0.6  1)
    (-0.6  1    1)

    (0.85 -1   -1)
    (0.85 -0.6 -1)
    (0.85  0.6 -1)
    (0.85  1   -1)
    (0.85 -1    1)
    (0.85 -0.6  1)
    (0.85  0.6  1)
    (0.85  1    1)

    (1 -1   -1)
    (1 -0.6 -1)
    (1  0.6 -1)
    (1  1   -1)
    (1 -1    1)
    (1 -0.6  1)
    (1  0.6  1)
    (1  1    1)
);

blocks
(
    hex (0 8 9 1 4 12 13 5)       (24 24 120)  simpleGrading (0.25 0.25 1)
    hex (1 9 10 2 5 13 14 6)      (24 120 120) simpleGrading (0.25 1 1)
    hex (2 10 11 3 6 14 15 7)     (24 24 120)  simpleGrading (0.25 4 1)

    hex (8 16 17 9 12 20 21 13)   (144 24 120)  simpleGrading (1 0.25 1)
    hex (9 17 18 10 13 21 22 14)  (144 120 120) simpleGrading (1 1 1)
    hex (10 18 19 11 14 22 23 15) (144 24 120)  simpleGrading (1 4 1)

    hex (16 24 25 17 20 28 29 21) (12 24 120)  simpleGrading (4 0.25 1)
    hex (17 25 26 18 21 29 30 22) (12 120 120) simpleGrading (4 1 1)
    hex (18 26 27 19 22 30 31 23) (12 24 120)  simpleGrading (4 4 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }

    down
    {
        type wall;
        faces
        (
            (0 8 12 4)
            (8 16 20 12)
            (16 24 28 20)
        );
    }

    up
    {
        type wall;
        faces
        (
            (3 7 15 11)
            (11 15 23 19)
            (19 23 31 27)
        );
    }

    front
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (8 9 17 16)
            (9 10 18 17)
            (10 11 19 18)
            (16 17 25 24)
            (17 18 26 25)
            (18 19 27 26)
        );
    }

    back
    {
        type wall;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (12 20 21 13)
            (13 21 22 14)
            (14 22 23 15)
            (20 28 29 21)
            (21 29 30 22)
            (22 30 31 23)
        );
    }
);

mergePatchPairs
(
);
