tutorials/pimpleHFDIBFoam/Immersed-SphereinCube-3D-Oscil/Immersed-Sphere-Oscillating/ImmersedSphere-Sin-Re20-800k/0.org/f
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type    zeroGradient;
    }

    right
    {
        type    zeroGradient;
    }

    down
    {
        type    zeroGradient;
    }

    up
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
