tutorials/pimpleHFDIBFoam/Immersed-SphereinCube-3D-Oscil/Immersed-Sphere-Oscillating/ImmersedSphere-Sin-Re20-800k/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /  O peration      | Website:  https://openfoam.org
|   \\  /   A nd            | OpenFOAM v8
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}

// Refine this cellSet
set             wake;

coordinateSystem global;

globalCoeffs
{
    tan1 (1 0 0);   // x
    tan2 (0 1 0);   // y
}

// refine ONLY in x and y (do NOT refine z)
directions      (tan1 tan2);

useHexTopology  yes;
geometricCut    no;
writeMesh       no;